InformationRegisters/АгентыЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>АгентыЦелевые</Name>
			<Comment>Реестр агентов все звонки которым считаются целевыми</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаЦелевая</Name>
					<Comment>Точка для которой оператор является целевым</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачБлокировки</Name>
					<Comment>Дата и время начала блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонБлокировки</Name>
					<Comment>Дата и время окончания блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстБлокировки</Name>
					<Comment>Причина блокировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИницаторБлокировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВизитнаяКарточка</Name>
					<Comment>Текст визитной карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеБлокироватьЗаЗвонкиОжидающиеОбработкиБолееСуток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Внутренний целевой телефон</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбъектыПривязка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыПривязка</Name>
			<Comment>Привязка объектов к элементам предприятия</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Comment>Владелец объекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелМобильные</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КонтактЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>КонтактЦентры</Name>
			<Comment>Контакт-центры</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Comment>Очередь контакт-центра. Используется для определения состояния паузы телефона (в очереди)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение к которому относится контакт-центр</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяКаскадОчередей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПочтовыеФильтры</Name>
					<Comment>Правила, в соответствии с которыми входящие почтовые сообщения помещаются в список контроля для данного контакт-центра</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Comment>Почтовый адрес или имя сервера отправителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Comment>Принадлежность адреса к подразделению</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
					<Comment>Список пользователей - сотрудников контакт-центра</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь - сотрудник контакт-центра</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПанельСостав</Name>
					<Comment>Состав панели быстрого вызова</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Подпись к кнопке быстрого вызова</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Comment>Телефон или очередь для быстрого вызова</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
								<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КаскадОчередей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрабатыватьАвтозвонок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Comment>Флаг активности пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Местонахождение группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
					<Comment>Учетная запись информационной базы с которой олицетворен пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияПараметр</Name>
					<Comment>Параметр аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Comment>Тип аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>96</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Comment>Используется в бизнес-процессе "Обратная связь лояльности" для постановки и отбора задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОткрытииПоказыватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
					<Comment>Полномочия пользователя</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦелевыеТочки</Name>
					<Comment>Целевые точки, которые доступны дополнительно, не зависимо от достуных подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОбщиеОчереди</Name>
					<Comment>Очереди, не привязанные к целевым точкам, но включающие агентов целевых звонков (общие очереди)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЗначенияСервера/Ext/Module.bsl
Функция ПолучитьКлючЗаписи(РегистрИмя,СтрКлюча) Экспорт

// Функция формирует и возвращает ключ записи для переданного в параметре "РегистрИмя" регистра
// сведений. Ключ формируется из структуры, переданной в параметре "СтрКлюча"
// При возникновении ошибки возвращается Неопределенность
//-------------------------------------------------------------------------------------------------
	Попытка
		Ответ = РегистрыСведений[СокрЛП(РегистрИмя)].СоздатьКлючЗаписи(СтрКлюча);
		Возврат (Ответ);
	Исключение
	КонецПопытки;

	Возврат Неопределено; 
	
КонецФункции

Функция ПолучитьЗначениеРеквизита(СсылкаИлиОбъект,ИмяРеквизита) Экспорт

// Функция возвращает значение реквизита с именем "ИмяРеквизита" из элемента или объекта
// При возникновении ошибки возвращается Неопределенность
//-------------------------------------------------------------------------------------------------
	Попытка
		Ответ = СсылкаИлиОбъект[СокрЛП(ИмяРеквизита)];
		Возврат (Ответ);
	Исключение
	КонецПопытки;

	Возврат Неопределено;
КонецФункции

Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт

// Функция возвращает значение константы с именем "ИмяКонстанты"
// При возникновении ошибки возвращается Неопределенность
//-------------------------------------------------------------------------------------------------
	Попытка
		Ответ = Константы[СокрЛП(ИмяКонстанты)].Получить();
		Возврат (Ответ);
	Исключение
	КонецПопытки;

	Возврат Неопределено;
КонецФункции

//-------------------------------------------------------------------------------------------------

Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра,Значение) Экспорт

// Процедура устанавливает значение параметра сеанса с именем "ИмяПараметра"
//-------------------------------------------------------------------------------------------------
	Попытка
		ПараметрыСеанса[СокрЛП(ИмяПараметра)] = Значение;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьЗначениеПараметраСеанса(ИмяПараметра) Экспорт

// Функция возвращает значение параметра сеанса с именем "ИмяПараметра"
// При возникновении ошибки возвращается Неопределенность
//-------------------------------------------------------------------------------------------------
	Попытка
		Ответ = ПараметрыСеанса[СокрЛП(ИмяПараметра)];
		Возврат (Ответ);
	Исключение
	КонецПопытки;

	Возврат Неопределено;
КонецФункции

//-------------------------------------------------------------------------------------------------

Функция ПолучитьКонтактЦентр(ПользовательСсылка = Неопределено) Экспорт

// Функция возвращает ссылку на контакт-центр если пользователь является сотрудником контакт-центра
// Функция возвращает пустую ссылку во всех остальных случаях. Если параметр "ПользовательСсылка"
// не передан, то возвращается информация о текущем пользователе
//-------------------------------------------------------------------------------------------------
	Доступно = 		ТипЗнч(ПользовательСсылка) = Тип("СправочникСсылка.Пользователи")
				И 	ЗначениеЗаполнено(ПользовательСсылка);
	ЦелеваяСсылка = ?(Доступно,ПользовательСсылка,ПараметрыСеанса.ТекущийПользователь);

// Получим ссылку на контакт-центр к которому относится пользователь
//-------------------------------------------------------------------------------------------------
	Запрос = Новый Запрос("SELECT TOP 1 Ссылка FROM Справочник.КонтактЦентры.Пользователи WHERE	(Пользователь = &Пользователь)");
	Запрос.УстановитьПараметр("Пользователь", ЦелеваяСсылка);  
	Результат = Запрос.Выполнить().Выбрать();
	Если (Результат.Следующий()) Тогда
		Возврат (Результат.Ссылка);
	КонецЕсли;

	Возврат (Справочники.КонтактЦентры.ПустаяСсылка());
КонецФункции

Функция ДоступныеПодразделения() Экспорт

// Функция возвращает массив со списком подразделений иерархия которых доступна текущему
// пользователю. Если доступные подразделения не найдены, то возвращается пустой массив
// Если пользователь является сотрудником контакт-центра, то список доступных подразделений будет
// взят из настроек контакт-центра
//-------------------------------------------------------------------------------------------------
	КЦСсылка = ПолучитьКонтактЦентр();

	Если (ЗначениеЗаполнено(КЦСсылка)) Тогда
		Ответ = КЦСсылка.Подразделения.ВыгрузитьКолонку("Подразделение");
	Иначе
		Ответ = ПараметрыСеанса.ТекущийПользователь.Подразделения.ВыгрузитьКолонку("Подразделение");
	КонецЕсли;

	Возврат (Ответ);
КонецФункции

Функция ДоступныеЦелевыеТочки() Экспорт

// Функция возвращает массив со списком целевых точек доступных текущему пользователю.
// Если доступные целевые точки не найдены, то возвращается пустой массив.
// Если пользователь является сотрудником контакт-центра, то список доступных целевых точек будет
// взят из настроек доступа контакт-центра
//-------------------------------------------------------------------------------------------------
	Запрос = Новый Запрос("SELECT DISTINCT Ссылка FROM	Справочник.ТочкиЦелевые WHERE КонтактЦентр = &КЦСсылка");
	Запрос.УстановитьПараметр("КЦСсылка",ПолучитьКонтактЦентр());
	Ответ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если (Ответ.Количество() > 0) Тогда
		Возврат (Ответ);
	КонецЕсли;

// Если мы оказались здесь, значит пользователь не является сотрудником контакт-центра
// Получим список целевых точек, которые относятся к подразделениям доступным пользователю
//-------------------------------------------------------------------------------------------------
	ТекстЗапроса = "
	|SELECT	DISTINCT Рег.ТочкаЦелевая AS Ссылка
	|FROM	РегистрСведений.АгентыЦелевые Рег
	|INNER	JOIN РегистрСведений.ОбъектыПривязка Прив ON (Прив.Владелец В ИЕРАРХИИ (&Подразделения)) И (Прив.Объект = Рег.Телефон)";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Подразделения",ДоступныеПодразделения());
	Ответ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат (Ответ);
КонецФункции

Функция ДоступныеЦелевыеТочки2() Экспорт

// Функция возвращает массив со списком целевых точек доступных текущему пользователю,
// вне зависимость от того является он сотрудинком контакт-центра или нет
// Если доступные целевые точки не найдены, то возвращается пустой массив.
// Если пользователь является сотрудником контакт-центра, то список доступных целевых точек будет
// взят из настроек доступа контакт-центра
//-------------------------------------------------------------------------------------------------
	ТекстЗапроса = "
	|SELECT	DISTINCT Рег.ТочкаЦелевая AS Ссылка
	|FROM	РегистрСведений.АгентыЦелевые Рег
	|INNER	JOIN РегистрСведений.ОбъектыПривязка Прив ON (Прив.Владелец В ИЕРАРХИИ (&Подразделения)) И (Прив.Объект = Рег.Телефон)";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Подразделения",ДоступныеПодразделения());
	Ответ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат (Ответ);
КонецФункции

//-------------------------------------------------------------------------------------------------

Функция БлокировкаСостояниеПолучить() Экспорт

// Функция получает информацию о текущей или планируемой блокировке базы данных
// Возвращаемое значение:
// - Ложь - блокировки нет и не планируется
// - Истина - время блокировки наступило
// - Строка - строка с текстом сообщения о предстоящей блокировке
//-------------------------------------------------------------------------------------------------
	Блокировка = ПолучитьБлокировкуСеансов();

// Если флаг блокировки устанолен (блокировка запланирована)
// Проверим, не наступило ли время блокировки. Если наступило, то возвратим Истину
//-------------------------------------------------------------------------------------------------
	Если (Блокировка.Установлена = Истина) Тогда
		Доступно = (Блокировка.Начало <= ТекущаяДата());
		Доступно = Доступно И (НЕ ПараметрыСеанса.РольДоступнаАдминистратор);

		Если (Доступно = Истина) Тогда
			Возврат Истина;
		КонецЕсли;

// Время блокировки еще не наступило
// Возвратим строку с информацией о предстоящей блокировке
//-------------------------------------------------------------------------------------------------
		Ответ = "Внимание !!! Администратор системы извещает Вас
		|о том что сегодня в " + СокрЛП(Формат(Блокировка.Начало,"ДФ = 'ЧЧ'' час.''мм'' мин.'")) + " по Московскому времени
		|будет временно прекращен доступ к программе ориентировочно на 5 - 10 минут";
		Возврат (Ответ);
	КонецЕсли;

	Возврат Ложь;
КонецФункции

Функция ТекущийПользователь() Экспорт

// Функция возвращает ссылку на элемент справочника "Пользователи" (на пользователя, под которым
// в настоящее время выполняется сеанс работы)
//-------------------------------------------------------------------------------------------------
	Ответ = ПараметрыСеанса.ТекущийПользователь;
	Ответ = ?(ЗначениеЗаполнено(Ответ),Ответ,Справочники.Пользователи.ЛокальнаяСистема);

	Возврат (Ответ);
КонецФункции

Функция ТекущаяДатаСервер() Экспорт

// Функция возвращает текущую дату и время сервера
//-------------------------------------------------------------------------------------------------
	Возврат (ТекущаяДата());
КонецФункции

Функция ТекущаяДатаКлиент() Экспорт

// Функция возвращает текущую дату и время текущего пользователя сеанса
// Возвращаемое значение - время сервера плюс/минус смещение времени текущего пользователя
// относительно времени сервера (Московского времени)
//-------------------------------------------------------------------------------------------------
	ТекПользователь = ТекущийПользователь();
	СмещениеСекунд = (ТекПользователь.СмещениеВремени * 3600);
	Ответ = (ТекущаяДатаСервер() + СмещениеСекунд);

	Возврат (Ответ);
КонецФункции
